In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression, LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

In [2]:
df = pd.read_csv("dataset.csv")

In [3]:
df.head()

   age  income  credit_score  loan_amount  approved
0   22   30000           580         5000         0
1   25   35000           620         7000         0
2   28   42000           690         6000         1
3   32   50000           710         9000         1
4   35   52000           650        10000         1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   age           15 non-null     int64
 1   income        15 non-null     int64
 2   credit_score  15 non-null     int64
 3   loan_amount   15 non-null     int64
 4   approved      15 non-null     int64
dtypes: int64(5)
memory usage: 732.0 bytes

In [5]:
df.describe()

             age        income  credit_score   loan_amount   approved
count  15.000000     15.000000      15.00000     15.000000  15.000000
mean   39.066667  53000.000000     672.00000  10666.666667   0.666667
std    11.967018  12789.504626      55.18799   3754.362542   0.487950
min    22.000000  30000.000000     580.00000   5000.000000   0.000000
25%    29.000000  43500.000000     630.00000   7500.000000   0.000000
50%    37.000000  55000.000000     690.00000  10000.000000   1.000000
75%    49.000000  61500.000000     715.00000  13500.000000   1.000000
max    60.000000  72000.000000     750.00000  17000.000000   1.000000